SFA_settings =
{

	autoupdate = false,
	piska = 1,
	req_limit = 0,
	debug = false,
	addons = { circle = false },

	last = {
		name = 'Основное',
		current = 1,
		select = { НАСТРОЙКИ = 'Биндики', ПРОЧЕЕ = 1 },
		menu = false
	},

	sort = {
		основное = decodeJson(
		'[["Мусоровоз","ресы","Автобус","Рудник вывезти руду","Принести водку","Уголь","Металл","Завоз метал","Завоз взрыв","Лесопилка","Химикаты","Аптечки","Антирадин","Корабль","Корабль2","Кукурузник","Гуманитарка","Пшеничка","Тыковки","Стройка","Стройка2","Стройка3","Стройка4","Стройка5","Ферма","Ферма2","Ферма3","Ферма4","Хлебороб","Вирус","Отель"],["Спавн","Телепорт по метке","Чекпоинт","Метка луна","Метка цербера","Смэрть","Банан-Бронь","Починить","Нычки","Сейф","Сбить скин","Предметы","Хлам","тпчек","Ремнаборы","Запчасти","Порох","Дум-дум","Заготовки","Спиздить залп","Нано","Электродетали","cклад в ЛВ","Подключиться","Клад","Школа","Отключиться"],["Отмычки","Мешки","Травка","Косячки","Еда","Регистратура","Спирт","Монолит","Долг","Свобода","Разрывные","Бронебой","Аптека","Похавать","Бронежелет","Салют","Дамба","Ловкач","Тайники","Заготовки2","Миниган","Бензин","Луна","Цербер","Постирать шмот","Починить шмот","Cупер броник","Швейный набор","Артефакты","Артефакты2","Артефакты3","Арт разлом"]]'),
		
		прочее = {"Dgun","Автоставка","Бот рудник","Квестики","Консоль","Мерцание","Места","МП рр","Синхра","Советка","Чатлог","Чекер"},

	},


	["Пикапы"] = decodeJson('{"2006.33":{"pos":[697.966796875,1293.2800292969,15.085300445557],"name":"Хлам (Свалка)","id":599},"2321.26":{"pos":[249.89739990234,67.717796325684,2003.6405029297],"name":"Чистая Вода (Дамба)","id":414},"1012.29":{"pos":[-178.92869567871,1166.5301513672,24.686100006104],"name":"Тайник (Карсон)","id":460},"3184.17":{"pos":[1089.8946533203,2098.9196777344,-4.6466999053955],"name":"Активка (Свобода)","id":435},"3287.9":{"pos":[745.00158691406,1440.1940917969,1102.703125],"name":"Стриптиз (Бейсад)","id":559},"2152.09":{"pos":[211.53089904785,1922.9208984375,17.640600204468],"name":"Военкомат (Анклав)","id":3255},"-3499.86":{"pos":[-1885.2512207031,-1636.3549804688,21.75],"name":"dssddssdsd","id":3224},"1020.55":{"pos":[-126.0391998291,1126.4520263672,20.138599395752],"name":"Хлам (Карсон)","id":603},"3839":{"pos":[1619.1999511719,2209,10.800000190735],"name":"Сера (ЛВ)","id":724},"1146.01":{"pos":[312.3005065918,-165.89210510254,999.60101318359],"name":"Тамара","id":375},"-2150.94":{"pos":[-994.5615234375,-1289.4801025391,133.1056060791],"name":"Травка (Ферма)","id":789},"2040.68":{"pos":[614.5009765625,-71.814300537109,1497.9921875],"name":"Верстак (Гараж)","id":598},"6229.13":{"pos":[2908.7890625,2217.6879882813,1102.6512451172],"name":"Ген (Разлом)","id":431},"2327.3":{"pos":[710.69592285156,1611.0008544922,5.5998997688293],"name":"1","id":3316},"1645.01":{"pos":[281.2966003418,1353.0899658203,10.625900268555],"name":"Сон (Нефтезавод)","id":399},"670.98":{"pos":[-67.502700805664,-255.4965057373,993.97540283203],"name":"Алкоголь (Алкозавод)","id":405},"-45.27":{"pos":[-2401.8032226563,2351.5434570313,4.9878997802734],"name":"Прораб (Бейсад)","id":484},"1902.39":{"pos":[-360.37030029297,2220.2805175781,42.484401702881],"name":"Тайник (Брудж)","id":463},"1277.43":{"pos":[287.68011474609,-111.76210021973,1101.515625],"name":"Бронежилет","id":449},"2403.74":{"pos":[580.37512207031,874.03820800781,949.33148193359],"name":"работа (Рудник)","id":403},"1251.87":{"pos":[-225.5359954834,1407.4689941406,69.9375],"name":"Сушка (Радар)","id":790},"685.78":{"pos":[-878.271484375,1538.140625,25.914100646973],"name":"Тайник (Робада)","id":464},"4926.38":{"pos":[2871.1335449219,944.44842529297,1110.80078125],"name":"Долг (Разлом)","id":428},"-2116.79":{"pos":[-1015.529296875,-1230.8232421875,129.56011962891],"name":"Травка (Ферма)","id":786},"-2107.69":{"pos":[-983.99066162109,-1257.7933349609,134.09858703613],"name":"Травка (Ферма)","id":788},"2851.63":{"pos":[623.32482910156,2204.7170410156,23.591199874878],"name":"Хлам (Судьи)","id":602},"-2096.74":{"pos":[-995.09613037109,-1233.0336914063,131.38551330566],"name":"Травка (Ферма)","id":787},"1007.24":{"pos":[-282.22421264648,1296.6325683594,-7.1725001335144],"name":"Светоч (Карсон)","id":543},"2837.88":{"pos":[210.59880065918,2610.0607910156,17.221200942993],"name":"Хлам (Аэродром2)","id":600},"-3500.02":{"pos":[-1889.2646484375,-1628.6783447266,17.9232006073],"name":"Прораб (Литейка)","id":434},"2162.01":{"pos":[324.32528686523,1831.8522949219,5.8336000442505],"name":"Регистратура (Анклав)","id":378},"6292.5":{"pos":[2807.91015625,2373.6721191406,1110.9195556641],"name":"Залп (Монолит)","id":617},"1210.47":{"pos":[-224.90989685059,1407.6079101563,27.773399353027],"name":"Бармен (Карсон)","id":364},"-67.67":{"pos":[2153.3254394531,-2237.2570800781,16.259099960327],"name":"Консервы (Склад ЛВ)","id":718},"-2202.65":{"pos":[-1026.4107666016,-1305.6374511719,129.40182495117],"name":"Травка (Ферма)","id":784},"2199.72":{"pos":[1749.0170898438,491.7253112793,-41.022300720215],"name":"Медуза (Корабль)","id":417},"1522.11":{"pos":[-799.35418701172,2262.6228027344,58.839698791504],"name":"Вход (Шаман)","id":673},"-466.91":{"pos":[-1940.8200683594,450.91430664063,1022.9921875],"name":"Банк","id":529},"1656.22":{"pos":[283.2705078125,1362.3266601563,10.625900268555],"name":"Нитро (Нефтезавод)","id":411},"2588.92":{"pos":[159.07400512695,2412.2768554688,17.571800231934],"name":"Хлам (Аэродром)","id":601},"1540.85":{"pos":[185.29580688477,1344.9715576172,10.585900306702],"name":"Хлам (Нефтезавод)","id":604},"4868.25":{"pos":[2855.0083007813,902.33111572266,1110.9095458984],"name":"Залп (Долг)","id":616},"2715.59":{"pos":[-794.18218994141,2445.4306640625,1064.3408203125],"name":"Бандиты (Малина)","id":366},"1541.55":{"pos":[615.66381835938,-72.108901977539,997.9921875],"name":"Механник (Нефтезавод)","id":389},"2710.49":{"pos":[-793.16168212891,2439.3068847656,1064.3413085938],"name":"Общак (Бандиты)","id":401},"2450.93":{"pos":[-91.610397338867,1027.0059814453,1515.5388183594],"name":"Шериф (Новички)","id":444},"2971.19":{"pos":[418.51809692383,2542.6752929688,10],"name":"Активка (Сталкера)","id":365},"-2163.87":{"pos":[-1023.2583618164,-1270.9384765625,130.32183837891],"name":"Травка (Ферма)","id":785},"2032.2":{"pos":[614.71661376953,-80.512603759766,1497.9995117188],"name":"Заготовки (Гараж)","id":597},"6004.07":{"pos":[1100.2481689453,1859.8754882813,3043.9453125],"name":"d","id":497},"-2134.68":{"pos":[-1058.396484375,-1205.4976806641,129.21879577637],"name":"Фермер","id":453},"3857.18":{"pos":[214.33219909668,3615.3388671875,27.513399124146],"name":"Банан (Остров)","id":582},"5354.76":{"pos":[1064.6334228516,1767.9171142578,2522.2097167969],"name":"Долг (ЛВ)","id":437},"-3500":{"pos":[-1889.2646484375,-1628.6783447266,17.9232006073],"name":"Прораб (Литейный Завод)","id":434},"2720.55":{"pos":[-781.58282470703,2437.7717285156,1064.3590087891],"name":"Пятая База (Бандиты)","id":670},"2319.21":{"pos":[1054.2252197266,1254.1531982422,10.82709980011],"name":"Активка (Монолит)","id":436},"2567.37":{"pos":[-263.91510009766,2769.2639160156,62.021598815918],"name":"Тайник (Боун)","id":462}}'),
	["Я ебал в рот"] = {},

	["Лодка"] = { block = false, id = 634 },
	["Бюрер"] = 82,
	["Каталина"] = -1,

	["Текстдравы"] = {

		["Радиация"] = 2057,
		["Голод"] = 2059,
		["Вирус"] = 2058,
		["Сон"] = 2060,
		["Хп+"] = 2062,
		["Вахта"] = 2056,
		["Хабар"] = 2065,

	},



	["Биндики"] = {

		["Список"] = {

			{ name = "Меню", keys = { "1" }, func = [[menu.switch()]], on = true },

			{ name = "Пангит - Нитро", keys = nil, func = [[ Пангит(7) ]], on = false },

			{ name = "Инвентарь - Ремнабор", keys = nil, func = [[ Инвентарь(13) ]], on = false },

			{ name = "/гараж", keys = nil, func = [[ dops = true sampSendChat("/гараж") ]], on = false },

			{ name = "/дом - выйти", keys = nil, func = [[ Дом(11) ]], on = false },

			{ name = "/дом - сейф", keys = { "1", "2", "3" }, func = [[ Дом(5) ]], on = false },

			{ name = "Мутация - Ступор", keys = nil, func = [[ Мутация(5) ]], on = false },

			{ name = "Мутация - Сумрак", keys = nil, func = [[ Мутация(4) ]], on = false },

			{ name = "Мутация - Пси", keys = nil, func = [[ Мутация(6) ]], on = false },

			{ name = "/cтелс", keys = nil, func = [[ sampSendChat("/стелс") ]], on = false },

			{ name = "Инвентарь - Аптечка", keys = nil, func = [[ Инвентарь(7) ]], on = false },

			{
				name = "Пангит - миниган",
				keys = nil,
				func = [[ Пангит(8) sampSendChat("/пангит") ]],
				on = false
			},

			{ name = "Пангит - джетпак", keys = nil, func = [[ Пангит(9) ]], on = false },

			{ name = "Инвентарь - Винт", keys = nil, func = [[ Инвентарь(12) ]], on = false },

			{ name = "Мутация - снорк", keys = nil, func = [[ Мутация(2) ]], on = false },

			{ name = "/дрон", keys = nil, func = [[ sampSendChat("/дрон") ]], on = false },

			{ name = "/джетпак", keys = nil, func = [[ sampSendChat("/джетпак") ]], on = false },

			{
				name = "Чат",
				keys = { "K" },
				func = [[ sampSetChatInputText("/kk ") sampSetChatInputEnabled(true) ]],
				on = true
			},

			{ name = "Мутация - бегун", keys = nil, func = [[ Мутация(3) ]], on = false },

			{ name = "Инвентарь - Арт", keys = nil, func = [[ Инвентарь(17) ]], on = false },

			{
				name = "Тп",
				keys = { "2" },
				func = [[ require('sfa.select.Основное.Телепорт по метке').func() ]],
				on = false
			},
		},
	},

	["Блок пикапов"] = {
		["Радар"] = false,
		["Исполка"] = false,
	},

	["Спам"] = {
		["Статус"] = false,
		["Строки"] = {
			{
				text = '[ЭФИР]Дежурный офицер: Красный - значит опасность! Не лезьте в красные зоны! Убьёт моментально!',
				color = -1
			},
			{
				text =
				"[ЭФИР]Дежурный офицер: Если ваш датчик радиации мигает красным, значит она накапливается слишком быстро!",
				color = -1
			},
			{ text = "[ЭФИР]Дежурный офицер: Начинаем урок ОБЖ в Зоне!", color = -1 },
			{
				text =
				"[ЭФИР]Дежурный офицер: Если ваш датчик радиации мигает красным, значит она накапливается слишком быстро!",
				color = -1
			},
			{
				text = "[ЭФИР]Дежурный офицер: Опасайтесь заражённых! Они быстро бегают, высоко прыгают и страшно рычат!",
				color = -1
			},
			{
				text = "[ЭФИР]Дежурный офицер: Если они вас заметят, то наверняка нападут! Сразу убегайте или прячьтесь!",
				color = -1
			},
			{
				text =
				"[ЭФИР]Дежурный офицер: Если вас укусит Мутант, то скоро вы тоже заразитесь и станете одним из них!",
				color = -1
			},
			{
				text =
				"[ЭФИР]Дежурный офицер: Также нужно бояться бандитов! Они могут ограбить, изнасиловать и забрать в рабство!",
				color = -1
			},
			{
				text = "[ЭФИР]Дежурный офицер: И напоследок - не стоит провоцировать военных!",
				color = -1
			},
			{ text = "[Цербер] Маленький мальчик деньги нашёл", color = -1 },
			{ text = "[Цербер] Взял перепрятал и в школу пошёл", color = -1 },
			{ text = "[Цербер] Зомби всех школьников съели в тот день", color = -1 },
			{ text = "[Цербер] Но в школе осталась подсказка тебе", color = -1 },
			{ text = "[Цербер] Если не трусишь то в школу пойди", color = -1 },
			{ text = "[Цербер] Где спрятан тайник подсказку найди!", color = -1 },
			{ text = "[Цербер] Ахахахаха!!!", color = -1 },
			{ text = "Вы уже сделали ставку! Дождитесь результата!", color = -1 },
		},
	},

	["Метро и сон"] = {
		["Статус"] = false,
		["Функции"] = {
			["Проснуться"] = false,
			["Затемнение"] = false,
		},
	},

	["Аттачи"] = {
		["Статус"] = false,
		["Модели"] = {
			-- {name = "маска", on = false},
			-- {name = "балаклава", on = false},
			-- {name = "пушки", on = false},
			-- {name = "кокаин", on = false},
			-- {name = "противогаз", on = false},
			-- {name = "нитро", on = false},
			-- {name = "Без название", list = {}, on = false},
		},
	},

	["Диалоги"] = {
		["Статус"] = false,
		["Список"] = {
			{ title = "", button = 1, select = 1, input = "", on = false },

			-- ["Окно подтверждения ставки на лото"] = false,
			-- ["Сейф"] = false,
			-- ["Заправка Канистры"] = false, -- "Без транспорта канистры сразу покупать будет"},
			-- ["Рулетка"] = false, -- "Можно будет выбрать по сколько ставить на большой рулетке"},
		},
	},

	["Автопароль"] = {
		["Статус"] = false,

		["Любой акк"] = { on = false, pass = "" },

		["Функции"] = {
			["Авторег"] = false,
			["Твинк"] = false,
			["Модели"] = false, --"Удаляет при кике или потери соединения аттачи"},
			["Смс"] = false,
			["Скин при входе"] = false,
			["Скрыть почту"] = false,
			["Акки"] = {
				{ pass = "", nick = "", on = false },
			},
		},
	},

	["Автовзлом"] = {
		["Отмычка"] = 12,
		["Отмычка открыть"] = 11,
		["Статус"] = false,
		["Функции"] = {
			["Задержка"] = 0,
			["Без задержки"] = true,
		},
	},

	["Антиафк"] = {
		["Статус"] = false,
	},

	["gol"] = {
		["Статус"] = false,
		["Ид"] = 2059,
		["Порог"] = 50,

	},


	["rad"] = {
		["Статус"] = false,
		["Ид"] = 2057,
		["Порог"] = 80,

	},

	["Аудиостримы и звуки"] =
	{
		["Статус"] = false,
		["Стримы"] = { { url = "", on = false }, },
		["Звуки"] = { { id = -1, on = false }, },
	},
	["Сорт"] = {},
}
--mark2


local json = function(orig_t, save_name)
	local loaded_table
	local f



	local save = function(save_orig)
		f = io.open(getWorkingDirectory() .. save_name, 'w')
		-- assert(f)

		local t = (save_orig) and loaded_table or orig_t
		f:write(encodeJson(t))
		f:close()
		--	Noti('SVAE '..(table and 'savedt' or 'orig_t'))
		return t
	end

	local load = function()
		f = io.open(getWorkingDirectory() .. save_name, 'r')
		if not f then
			print('Сохранение оригинальной')
			return save(true)
		end
		loaded_table = decodeJson(f:read('*a'))
		f:close()
		return loaded_table
	end

	return setmetatable(load(), {
		__call = function(self) save() end,

		__index = function(self, k)
			if not rawget(self, k) then
				msg(k, 'ключ не был найден в загруженных найстройках')

				if rawget(orig_t, k) then
					msg(k, 'но был найден в дефолтной таблице')
					rawset(self, k, orig_t[k])
					save()
				end
			end
		end,

		__newindex = function(t, k, v)
			rawset(t, k, v)
			save()

			sampAddChatMessage("ДОБАВЛЕН НОВЫЙ КЛЮЧ В ТАБЛИЦУ, ФАЙЛ СОХРАНЕН")
		end
	})
end


return json
