
return
{
    name = 'Миниган',
    icon = 'SKULL_CROSSBONES',
    hint = [[В виртуальном мире по местам спавна котейнеров телепортирует, затем домой возвращает]],
    func =
    function()
        local coords = {
            {1403.9268798828 , 1039.5721435547 , 9.8986797332764},
            {1679.3446044922, 1004.7817993164, 10.8203125},
            {1645.9068603516, 1937.0168457031, 12.057249069214},
            {1528.580078125, 2231.4362792969, 10.8203125},
            {1521.9281005859, 1614.5910644531, 10.8203125},
        }

        spawn()
        restoreCameraJumpcut()
        wait(1000)
        sendPos{t = coords}
        NoKick()
    end
}