
return
{
    name = 'Гуманитарка',
    icon = 'PLANE',
    hint = [[Нужно быть у самолёта,не кикает, аккуратней с людьми рядом]],
    func =
    function()
        samolett2 = true
        if isCharInAnyCar(PLAYER_PED) then
            local x, y, z = getCharCoordinates(PLAYER_PED)
            warpCharFromCarToCoord(PLAYER_PED, x, y + 1, z)
        end
        NoKick()
        wait(500)
        state2 = true
        local id, x, y, z = InCar(553)
        wait(300)
        SendSync(-105.05868530273 , 512.0029296875 , 53.34162902832)
        SendSync(-87.22395324707 , 1047.1312255859 , 67.041275024414)
        SendSync(272.84521484375 , 1447.6108398438 , 58.903106689453)
        SendSync(663.0751953125 , 1663.6505126953 , 60.803318023682)
        SendSync(236.79296875 , 1912.0090332031 , 67.543098449707)
        SendSync(380.14556884766 , 2500.1552734375 , 64.309700012207)
        SendSync(-231.50564575195 , 2625.4665527344 , 123.93656921387)
        SendSync(-488.22763061523 , 2610.1589355469 , 99.636871337891)
        SendSync(-391.35406494141 , 2270.0798339844 , 106.65605163574)
        SendSync(-1492.6147460938 , 2604.4538574219 , 113.77326965332)
        SendSync(-794.38562011719 , 1578.8819580078 , 75.543830871582)
        SendSync(290.53811645508 , 2507.0812988281 , 16.484375)
        state2 = false
    end
}