
return
{
    name = 'Кукурузник',
    icon = 'PLANE',
    hint = [[Нужно быть у кукурузника,не кикает, аккуратней с людьми рядом]],
    func =
    function()
        samolett = true
        if isCharInAnyCar(PLAYER_PED) then
            local x, y, z = getCharCoordinates(PLAYER_PED)
            warpCharFromCarToCoord(PLAYER_PED, x, y + 1, z)
        end
        NoKick()
        wait(500)
        state2 = true
        InCar(512)
        wait(300)
        SendSync(-1024.6737060547 , -931.36340332031 , 171.14692687988)
        SendSync(-1172.8856201172 , -930.66345214844 , 170.46723937988)
        SendSync(-1174.61328125 , -962.83660888672 , 169.78672790527)
        SendSync(-1025.1671142578 , -966.45001220703 , 167.24034118652)
        SendSync(-1028.3338623047 , -1006.7046508789 , 166.01989746094)
        SendSync(-1176.5454101563 , -1029.1674804688 , 169.23150634766)
        SendSync(-1175.0986328125 , -1050.4854736328 , 168.13063049316)
        SendSync(-1025.8559570313 , -1050.5233154297 , 166.84294128418)
        SendSync(-1114.6069335938 , -1270.5874023438 , 166.06169128418)
        SendSync(-1068.4643554688 , -1270.7839355469 , 166.42256164551)
        SendSync(291.93, 2505.53, 16.08)
        state2 = false
    end
}