
return
{
    name = 'Отель',
    icon = 'HOTEL',
    hint = [[Cейф, 4 секунды и почта, после спавн]],
    func =
    function()
        handler('dialog', {t = 'ПОЧТА'})
        handler('dialog', {t = 'Заброшенный отель', s = -1, i = ''})
        SendSync{pos = {2224.4130859375, -1153.4068603516, 1025.796875}, key = 1024}
        SendSync{pos = {2206.2905273438, -1170.2386474609, 1029.796875}, key = 1024}
        wait(4000)
        SendSync{pos = {2816.8337402344, -1175.7883300781, 1525.5699462891}, key = 1024}
        wait(3600)
        SendSync{pos = {449.71347045898, -82.117210388184, 999.5546875}, key = 1024}
        SendSync{pos = {414.74890136719, -22.708404541016, 1001.8046875}, key = 1024}
        SendSync{pos = {505.6584777832, -81.049324035645, 998.9609375}, key = 1024}
    end
}