
return
{
    name = 'Нано',
    icon = 'ROCKET',
    hint = [[Д]],
    func =
    function()
        local coords = {
            {1856.4884033203 , -2276.3681640625 , 1506.9749755859},
            {1855.8228759766 , -2288.8054199219 , 1506.9749755859},
            {1860.5738525391 , -2285.7514648438 , 1501.8265380859},
            {1865.6516113281 , -2279.5659179688 , 1501.8265380859},
            {1879.2796630859 , -2297.6760253906 , 1501.8265380859},
            {1886.0704345703 , -2306.9633789063 , 1501.8331298828},
            {1860.5734863281 , -2279.8684082031 , 1501.8265380859},
            {1894.0867919922 , -2298.5205078125 , 1501.8265380859},
            {1860.5959472656 , -2280.296875 , 1501.8265380859},
            {1860.5959472656 , -2280.296875 , 1501.8265380859},
            {1862.6450195313 , -2286.2202148438 , 1501.8265380859},
        }

        handler("onServerMessage", {text = "Бендер: "})
        handler("onServerMessage", {text = "Добыто с электроники:"})
        nano_counts = 0
        nano = true
        spawn()
        SendSync{pos = {1858.9410400391 , -2255.0966796875 , 1505.9825439453}, key = 1024}
        wait(200)
        if color == 267386880 and nano then
            if text:find("серебро") or text:find("золото") or text:find("платина") or text:find("иридий") or text:find("палладий") then
                nano_counts = nano_counts + text:match("%s %- (%d+)г")
                return false
            end
        end
        sendPos{t = coords, key = 1024}
        handler("dialog", {i = nano_counts})
    end
}