
local e = function (i)
    repeat wait(0) until i
end

return
{
    name = 'Школа',
    icon = 'SCHOOL',
    hint = [[Тайник школьника, делается примерно минут за 15]],
    func =
    function()
        local coords = {
            {269.54354858398, 120.4239730835, 3004.6171875},
            {277.24374389648, 110.52352142334, 3008.8203125},
            {256.88311767578, 115.55672454834, 3008.8129882813},
            {277.83584594727, 125.22169494629, 3008.8203125},
            {260.84017944336, 109.93097686768, 3004.6171875},
            {-349.14218139648, 1921.7875976563, 59.548782348633},
        }
        handler("player_pos", {3389.5})
        for k, v in ipairs{"Школа", "Компьютер", "Компьютер", "Записка", "Карта"} do
            handler("dialog", {t = v}, 55)
        end
        sendPos{t = coords, delay = 5000, key = 1024}
    end
}